# Python for Data Science using Pandas (Accessing Data)

## Run The Following Code
Hit SHIFT + ENTER when your cusor is inside the cell of code.<br/>

## Download Required Data
**The code below here are to downlod the data required for this Weekly Tasks. Don't worry about knowing how to code out this part.**

In [10]:
!pip install wget

Requirement already satisfied: wget in /Users/isaacxiao/opt/anaconda3/lib/python3.8/site-packages (3.2)

In [2]:
import wget
wget.download('https://d17lzt44idt8rf.cloudfront.net/data-week-06.zip')
!unzip data-week-06.zip -d .

Archive:  data-week-06.zip
   creating: ./data/0_raw_data/
  inflating: ./data/0_raw_data/hdb_resale_full_raw.csv
  inflating: ./data/0_raw_data/hdb_resale_sample_raw.csv
  inflating: ./data/0_raw_data/hdb_resale_sample_raw.txt
  inflating: ./data/0_raw_data/hdb_resale_sample_raw.xlsx
   creating: ./data/1_processed_data/
  inflating: ./data/1_processed_data/hdb_resale_full_processed.csv
  inflating: ./data/1_processed_data/hdb_resale_sample_processed.csv
  inflating: ./data/image.jpg

# Numpy: A very brief intro

In [3]:
import numpy as np

> Create an array of 1,1,2,3,5,8 <br/>
Compare with a list

In [4]:
my_array = np.array([1,1,2,3,5,8])
my_list = [1,1,2,3,5,8]

In [5]:
print("Array: ",my_array)
print("List : ",my_list)

Array:  [1 1 2 3 5 8]
List :  [1, 1, 2, 3, 5, 8]

> Check the type of my_array and my_list. <br/>

In [6]:
print("Array: ",type(my_array))
print("List : ",type(my_list))

Array:  <class 'numpy.ndarray'>
List :  <class 'list'>

> perform NumPy math functions

In [7]:
my_array = np.array([1,1,2,3,5,8])

In [8]:
print('sum:', np.sum(my_array))
print('min:', np.min(my_array))
print('max:', np.max(my_array))
print('mean:', np.mean(my_array))
print('var:', np.var(my_array))

sum: 20
min: 1
max: 8
mean: 3.3333333333333335
var: 6.222222222222221

# Pandas

## Reading data from common data files

> Data Preparation. Importing pandas

In [9]:
import pandas as pd

> Open up an Excel file

In [10]:
hdb = 'data/0_raw_data/hdb_resale_sample_raw.xlsx'

df = pd.read_excel(hdb)

> Open up a CSV file

In [11]:
hdb = 'data/0_raw_data/hdb_resale_sample_raw.csv'

df = pd.read_csv(hdb)

> viewing the contents of the dataset

## Understanding the data in DataFrame

The main dataset that we will work on is on HDB resale data.<br/>
See the description below for the fields given. <br/>
<br/>
<table>
    <tr><th>Field</th><th>Description</th></tr>
    <tr><td>Trans_YearMonth</td><td>year-month (YYYY-MM) for transaction</td></tr>
    <tr><td>town</td><td>town for the resale flat</td></tr>
    <tr><td>flat_type</td><td>flat type for the resale flat</td></tr>
    <tr><td>block</td><td>block for the resale flat</td></tr>
    <tr><td>street_name</td><td>street for the resale flat</td></tr>
    <tr><td>storey_range</td><td>range of the storey/level
    </td></tr>
    <tr><td>floor_area_sqm</td><td>floor area in square meter</td></tr>
    <tr><td>flat_model</td><td>model of resale flat</td></tr>
    <tr><td>lease_commence_date</td><td>year of lease commencement</td></tr>
    <tr><td>resale_price</td><td>price of the resale flat</td></tr>
</table>

In [12]:
df.shape

(15000, 10)

In [13]:
df.head()

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2015-03,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,260000.0
1,2015-08,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,289000.0
2,2016-11,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0
3,2017-01,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0
4,2017-10,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,200000.0

In [14]:
df.head(10)

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2015-03,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,260000.0
1,2015-08,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,289000.0
2,2016-11,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0
3,2017-01,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0
4,2017-10,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,200000.0
5,2017-11,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,232000.0
6,2018-01,JURONG EAST,3 ROOM,38,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,235000.0
7,2018-06,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,226000.0
8,2018-09,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,215000.0
9,2019-07,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,218000.0

In [15]:
df.tail()

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
14995,2013-06,JURONG WEST,5 ROOM,206,BOON LAY DR,19 TO 21,120.0,Standard,1976,495000.0
14996,2013-06,JURONG WEST,5 ROOM,211,BOON LAY PL,07 TO 09,130.0,Adjoined flat,1976,530000.0
14997,2013-06,MARINE PARADE,3 ROOM,67,MARINE DR,01 TO 03,65.0,Improved,1976,400000.0
14998,2013-06,MARINE PARADE,4 ROOM,76,MARINE DR,01 TO 03,82.0,Improved,1976,540000.0
14999,2013-06,MARINE PARADE,4 ROOM,62,MARINE DR,04 TO 06,87.0,Improved,1976,611888.0

In [16]:
df.columns

Index(['Tranc_YearMonth', 'town', 'flat_type', 'block', 'street_name',
       'storey_range', 'floor_area_sqm', 'flat_model', 'lease_commence_date',
       'resale_price'],
      dtype='object')

In [17]:
# return names of column as a list
list(df.columns)

['Tranc_YearMonth',
 'town',
 'flat_type',
 'block',
 'street_name',
 'storey_range',
 'floor_area_sqm',
 'flat_model',
 'lease_commence_date',
 'resale_price']

> Locating data

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15000 entries, 0 to 14999
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Tranc_YearMonth      15000 non-null  object
 1   town                 15000 non-null  object
 2   flat_type            15000 non-null  object
 3   block                15000 non-null  object
 4   street_name          15000 non-null  object
 5   storey_range         15000 non-null  object
 6   floor_area_sqm       15000 non-null  float64
 7   flat_model           15000 non-null  object
 8   lease_commence_date  15000 non-null  int64
 9   resale_price         15000 non-null  float64
dtypes: float64(2), int64(1), object(7)
memory usage: 1.1+ MB

In [19]:
df.describe()

       floor_area_sqm  lease_commence_date  resale_price
count    15000.000000         15000.000000  1.500000e+04
mean        69.900960          1972.663600  3.552616e+05
std         17.976735             2.842588  1.296763e+05
min         31.000000          1966.000000  1.400000e+05
25%         60.000000          1970.000000  2.700000e+05
50%         65.000000          1974.000000  3.200000e+05
75%         75.000000          1975.000000  3.950000e+05
max        280.000000          1976.000000  1.185000e+06

## Accessing the Data by Columns

In [20]:
df['Tranc_YearMonth']

0        2015-03
1        2015-08
2        2016-11
3        2017-01
4        2017-10
          ...
14995    2013-06
14996    2013-06
14997    2013-06
14998    2013-06
14999    2013-06
Name: Tranc_YearMonth, Length: 15000, dtype: object

In [21]:
type(df['Tranc_YearMonth'])

pandas.core.series.Series

In [22]:
df['town'][0]

'JURONG EAST'

In [23]:
df[['Tranc_YearMonth','town']]

      Tranc_YearMonth           town
0             2015-03    JURONG EAST
1             2015-08    JURONG EAST
2             2016-11    JURONG EAST
3             2017-01    JURONG EAST
4             2017-10    JURONG EAST
...               ...            ...
14995         2013-06    JURONG WEST
14996         2013-06    JURONG WEST
14997         2013-06  MARINE PARADE
14998         2013-06  MARINE PARADE
14999         2013-06  MARINE PARADE

[15000 rows x 2 columns]

In [24]:
type(df[['Tranc_YearMonth','town']])

pandas.core.frame.DataFrame

## Understanding data in a column

> Understanding data in a colum, using these methods
> - info
> - describe
> - unique values
> - value counts

In [25]:
df['flat_model'].unique()

array(['Improved', 'Standard', 'Adjoined flat', 'Terrace',
       'New Generation'], dtype=object)

In [26]:
df['flat_type'].value_counts()

3 ROOM    11191
4 ROOM     1947
5 ROOM      942
2 ROOM      821
1 ROOM       99
Name: flat_type, dtype: int64

## Accessing data by rows, using conditional statement(s)

In [27]:
# return a Series of the values in the town column (a collection objet that similar to LIST)
df['town']

0          JURONG EAST
1          JURONG EAST
2          JURONG EAST
3          JURONG EAST
4          JURONG EAST
             ...
14995      JURONG WEST
14996      JURONG WEST
14997    MARINE PARADE
14998    MARINE PARADE
14999    MARINE PARADE
Name: town, Length: 15000, dtype: object

In [28]:
# use comparators (e.g., ==, !=, >=) to make this into a conditional statement
df['town'] == 'JURONG EAST'

0         True
1         True
2         True
3         True
4         True
         ...
14995    False
14996    False
14997    False
14998    False
14999    False
Name: town, Length: 15000, dtype: bool

In [29]:
# performing the result (Boolean) of the conditional statement to select rows that meet the criterion
# this is also known as filtering
df[df['town'] == 'JURONG EAST']

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2015-03,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,260000.0
1,2015-08,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,289000.0
2,2016-11,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0
3,2017-01,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0
4,2017-10,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,200000.0
5,2017-11,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,232000.0
6,2018-01,JURONG EAST,3 ROOM,38,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,235000.0
7,2018-06,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,226000.0
8,2018-09,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,215000.0
9,2019-07,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,218000.0
10,2019-09,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,220000.0
11,2020-01,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,220000.0
12,2020-03,JURONG EAST,3 ROOM,38,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,210000.0
13,2020-08,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,228000.0
14,2020-12,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,230000.0
15,2013-01,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,315000.0
16,2013-04,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,311000.0
17,2013-07,JURONG EAST,3 ROOM,38,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,310000.0

In [30]:
# Select rows based on multiple criteria, by joining then usng & and | (logical operators)
# Note that it's compulsory to have the round blacket () for each criterion and must use the & and | (not AND and OR operators)
df[(df['town'] == 'JURONG EAST') & (df['resale_price'] < 250000)]

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
4,2017-10,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,200000.0
5,2017-11,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,232000.0
6,2018-01,JURONG EAST,3 ROOM,38,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,235000.0
7,2018-06,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,226000.0
8,2018-09,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,215000.0
9,2019-07,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,218000.0
10,2019-09,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,220000.0
11,2020-01,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,220000.0
12,2020-03,JURONG EAST,3 ROOM,38,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,210000.0
13,2020-08,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,228000.0
14,2020-12,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,230000.0

In [31]:
df[(df['town'] == 'JURONG EAST') | (df['resale_price'] < 250000)]

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2015-03,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,260000.0
1,2015-08,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,289000.0
2,2016-11,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0
3,2017-01,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0
4,2017-10,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,200000.0
...,...,...,...,...,...,...,...,...,...,...
14389,2021-03,JURONG WEST,3 ROOM,209,BOON LAY PL,01 TO 03,65.0,Improved,1976,248000.0
14390,2021-03,JURONG WEST,3 ROOM,209,BOON LAY PL,01 TO 03,65.0,Improved,1976,245000.0
14391,2021-03,JURONG WEST,3 ROOM,211,BOON LAY PL,10 TO 12,65.0,Improved,1976,232000.0
14413,2021-03,WOODLANDS,3 ROOM,6,MARSILING DR,04 TO 06,65.0,Improved,1976,228888.0
14439,2021-04,WOODLANDS,3 ROOM,13,MARSILING LANE,07 TO 09,76.0,Improved,1976,240000.0

In [32]:
df[(df['town'] != 'JURONG EAST')]

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
18,2015-01,GEYLANG,3 ROOM,20,BALAM RD,04 TO 06,60.3,Standard,1967,275000.0
19,2015-01,GEYLANG,3 ROOM,23,BALAM RD,07 TO 09,60.3,Standard,1967,282000.0
20,2015-01,QUEENSTOWN,3 ROOM,83,C'WEALTH CL,04 TO 06,60.0,Standard,1967,310000.0
21,2015-01,QUEENSTOWN,3 ROOM,95,C'WEALTH DR,04 TO 06,68.0,Standard,1967,335000.0
22,2015-01,QUEENSTOWN,3 ROOM,93,C'WEALTH DR,04 TO 06,60.0,Standard,1967,350000.0
...,...,...,...,...,...,...,...,...,...,...
14995,2013-06,JURONG WEST,5 ROOM,206,BOON LAY DR,19 TO 21,120.0,Standard,1976,495000.0
14996,2013-06,JURONG WEST,5 ROOM,211,BOON LAY PL,07 TO 09,130.0,Adjoined flat,1976,530000.0
14997,2013-06,MARINE PARADE,3 ROOM,67,MARINE DR,01 TO 03,65.0,Improved,1976,400000.0
14998,2013-06,MARINE PARADE,4 ROOM,76,MARINE DR,01 TO 03,82.0,Improved,1976,540000.0
14999,2013-06,MARINE PARADE,4 ROOM,62,MARINE DR,04 TO 06,87.0,Improved,1976,611888.0

# Doing calculations using columns in a DataFrame

In [33]:
# first, understand how to create a new column
df['resale_price_in_thousands'] = 'test'
df.head(5)

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,resale_price_in_thousands
0,2015-03,JURONG EAST,3 ROOM,39,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,260000.0,test
1,2015-08,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,289000.0,test
2,2016-11,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0,test
3,2017-01,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,04 TO 06,67.0,Improved,1966,250000.0,test
4,2017-10,JURONG EAST,3 ROOM,37,TEBAN GDNS RD,01 TO 03,67.0,Improved,1966,200000.0,test

In [34]:
df['resale_price'] / 1000

0        260.000
1        289.000
2        250.000
3        250.000
4        200.000
          ...
14995    495.000
14996    530.000
14997    400.000
14998    540.000
14999    611.888
Name: resale_price, Length: 15000, dtype: float64

In [35]:
df['resale_price_in_thousands'] = df['resale_price'] / 1000

In [36]:
# Now try using multiple columns 
df['price_per_sqm'] = df['resale_price'] / df['floor_area_sqm']

In [37]:
# Removing a column 
df = df.drop('resale_price_in_thousands', axis=1)

# Using Numpy functions with a DataFrame

In [38]:
# using the function from Numpy
np.mean(df['resale_price'])

355261.5643086667

In [39]:
# using the built-in numpy functions from the DataFrame object
# encouraged way, but not all functions may available via this way
df['resale_price'].mean()

355261.5643086667

In [40]:
# creating a subset of the dataframe, selected columns only
df_sub = df[['resale_price', 'price_per_sqm']]
df_sub

       resale_price  price_per_sqm
0          260000.0    3880.597015
1          289000.0    4313.432836
2          250000.0    3731.343284
3          250000.0    3731.343284
4          200000.0    2985.074627
...             ...            ...
14995      495000.0    4125.000000
14996      530000.0    4076.923077
14997      400000.0    6153.846154
14998      540000.0    6585.365854
14999      611888.0    7033.195402

[15000 rows x 2 columns]

In [41]:
# applying the mean() method to the columns 
# that is, to average the values across columns
df_sub.mean(axis=1)

0        131940.298507
1        146656.716418
2        126865.671642
3        126865.671642
4        101492.537313
             ...
14995    249562.500000
14996    267038.461538
14997    203076.923077
14998    273292.682927
14999    309460.597701
Length: 15000, dtype: float64

In [42]:
# applying the mean() method to rows
# that is, to average the values across rows
df_sub.mean(axis=0)

resale_price     355261.564309
price_per_sqm      5056.182315
dtype: float64

## Extra: Getting data from websites (Intenet required)

In [43]:
# Have a look at the website to see how it looks visually
tables = pd.read_html('https://en.wikipedia.org/wiki/List_of_unicorn_startup_companies')

In [44]:
# Get the 3rd DataFrames that being captured
tables[2]

,Company,Last valuation(US$billions),Valuation date,Exit date,Exit reason,Exit valuation(US$billions),Country,Founders
0,Uber,72,August 2018[576],May 2019[577],IPO,82.4,US,"Travis Kalanick, Garett Camp"
1,DiDi,62,July 2019[578],June 2021[579],IPO,73,China,Cheng Wei
2,Facebook,50,January 2011,May 2012[580],IPO,104,US,"Mark Zuckerberg, Eduardo Saverin, Andrew McCol..."
3,Xiaomi,45,April 2015,July 2018[581],IPO,70,China,Lei Jun
4,Alibaba,42,June 2016,September 2014[582],IPO,238,China,Jack Ma
...,...,...,...,...,...,...,...,...
191,Zimi,1+,February 2015[125],March 2021[825],Acquired,0.4,China,NaN
192,QingCloud,1+,June 2017[125],March 2021[826],IPO,0.46,China,NaN
193,Novogene,1+,November 2016[125],April 2021,IPO,NaN,China,NaN
194,MissFresh,1+,December 2017[125],June 2021[827],IPO,2.5,China,NaN
195,Essential Products,1+,August 2017[828],February 2020[829],Defunct,NaN,US,NaN

# !! Your Turn !!

## Replace the code marked as <..> COMPLETELY with your own.
For example:
length = <..> will be replaced by length = 10

# Question 1 
1) Read hdb_resale_full_raw.csv into pandas and named it <b>df_hdb</b> <br/>
2) print out the shape of <b>df_hdb</b>

In [ ]:
df_hdb = <..>

<..>

In [13]:
hdb = 'data/0_raw_data/hdb_resale_full_raw.csv'

df_hdb = pd.read_csv(hdb)

df_hdb.shape

(185968, 10)


3) Find out how many non-null records are there for each column\
hint: using the methods that we have learnt from codes above (or from this week's content)

In [ ]:
<..>

In [14]:
# Finding the number of non-null records for each column in df_hdb
print(df_hdb.count())

Tranc_YearMonth        185968
town                   185968
flat_type              185968
block                  185968
street_name            185968
storey_range           185968
floor_area_sqm         185968
flat_model             185968
lease_commence_date    185968
resale_price           185968
dtype: int64

# Question 2
1) list out the unique values for <b>flat_type</b> <br/>
2) print out the number of records for each of the <b>town</b> <br/>

In [ ]:
<..>

In [15]:
# Listing the unique values in the 'flat_type' column
print(df_hdb['flat_type'].unique())

['3 ROOM' '4 ROOM' '5 ROOM' '2 ROOM' 'EXECUTIVE' '1 ROOM'
 'MULTI-GENERATION']

In [ ]:
<..>

In [16]:
# Printing the number of records for each town
print(df_hdb['town'].value_counts())

JURONG WEST        14152
WOODLANDS          13944
SENGKANG           13692
TAMPINES           12939
YISHUN             12301
BEDOK              11128
PUNGGOL             9615
HOUGANG             9258
ANG MO KIO          8661
CHOA CHU KANG       7856
BUKIT MERAH         7227
BUKIT PANJANG       7029
BUKIT BATOK         7005
TOA PAYOH           5967
PASIR RIS           5950
KALLANG/WHAMPOA     5398
QUEENSTOWN          5113
GEYLANG             4919
SEMBAWANG           4572
CLEMENTI            4445
JURONG EAST         4209
SERANGOON           3872
BISHAN              3537
CENTRAL AREA        1522
MARINE PARADE       1203
BUKIT TIMAH          454
Name: town, dtype: int64

# Question 3

1) Select the all the records from **Ang Mo Kio**.\
No need to assign the output to any variable, just show the filtered dataframe on the notebook.

In [ ]:
<..>

In [17]:
# Selecting all the records from Ang Mo Kio
amk_df = df_hdb[df_hdb['town'] == 'ANG MO KIO']

# Showing the filtered dataframe
print(amk_df)

       Tranc_YearMonth        town  flat_type block        street_name  \
0              2015-01  ANG MO KIO     3 ROOM   174   ANG MO KIO AVE 4
1              2015-01  ANG MO KIO     3 ROOM   541  ANG MO KIO AVE 10
2              2015-01  ANG MO KIO     3 ROOM   163   ANG MO KIO AVE 4
3              2015-01  ANG MO KIO     3 ROOM   446  ANG MO KIO AVE 10
4              2015-01  ANG MO KIO     3 ROOM   557  ANG MO KIO AVE 10
...                ...         ...        ...   ...                ...
181943         2014-12  ANG MO KIO     5 ROOM   642   ANG MO KIO AVE 5
181944         2014-12  ANG MO KIO     5 ROOM  700B   ANG MO KIO AVE 6
181945         2014-12  ANG MO KIO     5 ROOM  596B   ANG MO KIO ST 52
181946         2014-12  ANG MO KIO  EXECUTIVE   611   ANG MO KIO AVE 5
184985         2021-02  ANG MO KIO     3 ROOM   339   ANG MO KIO AVE 1

       storey_range  floor_area_sqm      flat_model  lease_commence_date  \
0          07 TO 09            60.0        Improved                 1986
1          01 TO 03            68.0  New Generation                 1981
2          01 TO 03            69.0  New Generation                 1980
3          01 TO 03            68.0  New Generation                 1979
4          07 TO 09            68.0  New Generation                 1980
...             ...             ...             ...                  ...
181943     13 TO 15           121.0        Improved                 1980
181944     16 TO 18           111.0        Improved                 2003
181945     07 TO 09           110.0        Improved                 2002
181946     10 TO 12           178.0   Adjoined flat                 1980
184985     01 TO 03            66.0        Improved                 1981

        resale_price
0           255000.0
1           275000.0
2           285000.0
3           290000.0
4           290000.0
...              ...
181943      618000.0
181944      808000.0
181945      745000.0
181946      938000.0
184985      282000.0

[8661 rows x 10 columns]

2) Select the all the records of which the lease commence date is before 1980.\
No need to assign the output to any variable, just show the filtered dataframe on the notebook.

In [ ]:
<..>

In [18]:
# Selecting all the records where the lease commence date is before 1980
old_lease_df = df_hdb[df_hdb['lease_commence_date'] < 1980]

# Showing the filtered dataframe
print(old_lease_df)

       Tranc_YearMonth             town flat_type block        street_name  \
3              2015-01       ANG MO KIO    3 ROOM   446  ANG MO KIO AVE 10
8              2015-01       ANG MO KIO    3 ROOM   109   ANG MO KIO AVE 4
10             2015-01       ANG MO KIO    3 ROOM   218   ANG MO KIO AVE 1
13             2015-01       ANG MO KIO    3 ROOM   471  ANG MO KIO AVE 10
14             2015-01       ANG MO KIO    3 ROOM   434  ANG MO KIO AVE 10
...                ...              ...       ...   ...                ...
185948         2014-05  KALLANG/WHAMPOA    3 ROOM     3    ST. GEORGE'S RD
185950         2014-06  KALLANG/WHAMPOA    3 ROOM     3    ST. GEORGE'S RD
185957         2014-10  KALLANG/WHAMPOA    3 ROOM     2    ST. GEORGE'S RD
185963         2014-12  KALLANG/WHAMPOA    3 ROOM     2    ST. GEORGE'S RD
185966         2014-12  KALLANG/WHAMPOA    4 ROOM     1    ST. GEORGE'S RD

       storey_range  floor_area_sqm      flat_model  lease_commence_date  \
3          01 TO 03            68.0  New Generation                 1979
8          01 TO 03            67.0  New Generation                 1978
10         07 TO 09            67.0  New Generation                 1976
13         07 TO 09            67.0  New Generation                 1979
14         07 TO 09            67.0  New Generation                 1979
...             ...             ...             ...                  ...
185948     01 TO 03            59.0        Improved                 1976
185950     04 TO 06            59.0        Improved                 1976
185957     07 TO 09            59.0        Improved                 1976
185963     13 TO 15            59.0        Improved                 1976
185966     10 TO 12            82.0        Improved                 1976

        resale_price
3           290000.0
8           300000.0
10          308000.0
13          319000.0
14          320000.0
...              ...
185948      290000.0
185950      315000.0
185957      290000.0
185963      345000.0
185966      426000.0

[29361 rows x 10 columns]

# Question 4

1. Select resale transactions for flats in **Bedok** and under $300,000 in resale price\
No need to assign the output to any variable, just show the filtered dataframe on the notebook.

In [ ]:
<..>

In [19]:
# Selecting the resale transactions for flats in Bedok and under $300,000 in resale price
bedok_df = df_hdb[(df_hdb['town'] == 'BEDOK') & (df_hdb['resale_price'] < 300000)]

# Showing the filtered dataframe
print(bedok_df)

       Tranc_YearMonth   town flat_type block         street_name  \
59             2015-01  BEDOK    2 ROOM   620  BEDOK RESERVOIR RD
60             2015-01  BEDOK    2 ROOM    38        BEDOK STH RD
61             2015-01  BEDOK    3 ROOM   504      BEDOK NTH ST 3
62             2015-01  BEDOK    3 ROOM   545      BEDOK NTH ST 3
63             2015-01  BEDOK    3 ROOM   546      BEDOK NTH ST 3
...                ...    ...       ...   ...                 ...
181973         2014-12  BEDOK    3 ROOM   620  BEDOK RESERVOIR RD
181988         2014-12  BEDOK    3 ROOM    26   NEW UPP CHANGI RD
183445         2020-03  BEDOK    2 ROOM  807B        CHAI CHEE RD
184026         2020-10  BEDOK    2 ROOM  807B        CHAI CHEE RD
184724         2021-01  BEDOK    2 ROOM  808B        CHAI CHEE RD

       storey_range  floor_area_sqm      flat_model  lease_commence_date  \
59         07 TO 09            45.0        Improved                 1986
60         07 TO 09            44.0        Improved                 1978
61         07 TO 09            59.0        Improved                 1978
62         07 TO 09            68.0  New Generation                 1980
63         01 TO 03            68.0  New Generation                 1980
...             ...             ...             ...                  ...
181973     07 TO 09            61.0        Improved                 1986
181988     01 TO 03            66.0        Improved                 1974
183445     01 TO 03            47.0         Model A                 2016
184026     01 TO 03            47.0         Model A                 2016
184724     01 TO 03            47.0         Model A                 2016

        resale_price
59          246000.0
60          255000.0
61          270000.0
62          280000.0
63          280000.0
...              ...
181973      285000.0
181988      270000.0
183445      240000.0
184026      260000.0
184724      275000.0

[2027 rows x 10 columns]

2. Select resale transactions for flats in Bedok and Ang Mo Kio, which the resale price is between \$250k and 500K \
No need to assign the output to any variable, just show the filtered dataframe on the notebook.

In [ ]:
<..>

In [20]:
# Selecting the resale transactions for flats in Bedok and Ang Mo Kio, which the resale price is between $250k and 500K
filtered_df = df_hdb[(df_hdb['town'].isin(['BEDOK', 'ANG MO KIO'])) & (df_hdb['resale_price'].between(250000, 500000))]

# Showing the filtered dataframe
print(filtered_df)

       Tranc_YearMonth        town flat_type block        street_name  \
0              2015-01  ANG MO KIO    3 ROOM   174   ANG MO KIO AVE 4
1              2015-01  ANG MO KIO    3 ROOM   541  ANG MO KIO AVE 10
2              2015-01  ANG MO KIO    3 ROOM   163   ANG MO KIO AVE 4
3              2015-01  ANG MO KIO    3 ROOM   446  ANG MO KIO AVE 10
4              2015-01  ANG MO KIO    3 ROOM   557  ANG MO KIO AVE 10
...                ...         ...       ...   ...                ...
184988         2021-02       BEDOK    3 ROOM  807A       CHAI CHEE RD
184989         2021-02       BEDOK    3 ROOM  808A       CHAI CHEE RD
185251         2021-03       BEDOK    3 ROOM  808B       CHAI CHEE RD
185579         2021-04       BEDOK    3 ROOM  808C       CHAI CHEE RD
185580         2021-04       BEDOK    3 ROOM  807C       CHAI CHEE RD

       storey_range  floor_area_sqm      flat_model  lease_commence_date  \
0          07 TO 09            60.0        Improved                 1986
1          01 TO 03            68.0  New Generation                 1981
2          01 TO 03            69.0  New Generation                 1980
3          01 TO 03            68.0  New Generation                 1979
4          07 TO 09            68.0  New Generation                 1980
...             ...             ...             ...                  ...
184988     13 TO 15            68.0         Model A                 2016
184989     10 TO 12            68.0         Model A                 2016
185251     01 TO 03            68.0         Model A                 2016
185579     07 TO 09            68.0         Model A                 2016
185580     01 TO 03            68.0         Model A                 2016

        resale_price
0           255000.0
1           275000.0
2           285000.0
3           290000.0
4           290000.0
...              ...
184988      480000.0
184989      480000.0
185251      425000.0
185579      475000.0
185580      445000.0

[14735 rows x 10 columns]

3. What are the differetn **flat_model** available in the resale transactions for **4-room** flats in **bedok**.\
Print out each of the **flat_model** on a separat line.

In [ ]:
<..>

In [21]:
# Filtering the dataframe to only include 4-room flats in Bedok
bedok_4room_df = df_hdb[(df_hdb['town'] == 'BEDOK') & (df_hdb['flat_type'] == '4 ROOM')]

# Finding the unique flat models
flat_models = bedok_4room_df['flat_model'].unique()

# Printing out each flat model on a separate line
for model in flat_models:
    print(model)

New Generation
Simplified
Improved
Model A
Premium Apartment
Adjoined flat
DBSS

In [22]:
bedok_4room_df['flat_model'].value_counts()

New Generation       1707
Model A               871
Improved              423
Simplified            401
Premium Apartment     236
DBSS                   43
Adjoined flat           1
Name: flat_model, dtype: int64

# Question 5
1) create new field <b>floor_area_sqft</b> (Use conversion of 1 sqm = 10.7639 sqft) <br/>
2) create new field <b>price_per_sqft</b> by using resale_price and floor_area_sqft

In [ ]:
<..>

In [27]:
# Creating a new column 'floor_area_sqft' by converting 'floor_area_sqm' to square feet
df_hdb['floor_area_sqft'] = df_hdb['floor_area_sqm'] * 10.7639

In [28]:
df_hdb.head(5)

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,floor_area_sqft,price_per_sqft
0,2015-01,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,255000.0,645.8340,394.838302
1,2015-01,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,275000.0,731.9452,375.711187
2,2015-01,ANG MO KIO,3 ROOM,163,ANG MO KIO AVE 4,01 TO 03,69.0,New Generation,1980,285000.0,742.7091,383.730319
3,2015-01,ANG MO KIO,3 ROOM,446,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1979,290000.0,731.9452,396.204525
4,2015-01,ANG MO KIO,3 ROOM,557,ANG MO KIO AVE 10,07 TO 09,68.0,New Generation,1980,290000.0,731.9452,396.204525

In [ ]:
<..>

In [29]:
# Creating a new column 'price_per_sqft' by dividing 'resale_price' by 'floor_area_sqft'
df_hdb['price_per_sqft'] = df_hdb['resale_price'] / df_hdb['floor_area_sqft']

In [30]:
df_hdb.head(5)

,Tranc_YearMonth,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,floor_area_sqft,price_per_sqft
0,2015-01,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,255000.0,645.8340,394.838302
1,2015-01,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,275000.0,731.9452,375.711187
2,2015-01,ANG MO KIO,3 ROOM,163,ANG MO KIO AVE 4,01 TO 03,69.0,New Generation,1980,285000.0,742.7091,383.730319
3,2015-01,ANG MO KIO,3 ROOM,446,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1979,290000.0,731.9452,396.204525
4,2015-01,ANG MO KIO,3 ROOM,557,ANG MO KIO AVE 10,07 TO 09,68.0,New Generation,1980,290000.0,731.9452,396.204525

# Question 6

1. What is the **average floor_area_sqm** for 3-room flats from **Ang Mo Kio**|

In [ ]:
<..>

In [31]:
# Filtering for 3-room flats in Ang Mo Kio
df_filtered = df_hdb[(df_hdb['town'] == 'ANG MO KIO') & (df_hdb['flat_type'] == '3 ROOM')]

# Calculating the average floor area
avg_floor_area = df_filtered['floor_area_sqm'].mean()

# Printing the result
print(f"The average floor area for 3-room flats in Ang Mo Kio is {avg_floor_area:.2f} sqm.")

The average floor area for 3-room flats in Ang Mo Kio is 70.96 sqm.

2. What is the **average resale price** for those 3-room flats from **Ang Mo Kio** that the flat's floor area is smaller than the average from part 1. above

In [ ]:
<..>

In [32]:
# Filtering for 3-room flats in Ang Mo Kio
df_filtered = df_hdb[(df_hdb['town'] == 'ANG MO KIO') & (df_hdb['flat_type'] == '3 ROOM')]

# Calculating the average floor area
avg_floor_area = df_filtered['floor_area_sqm'].mean()

# Filtering for 3-room flats in Ang Mo Kio with floor area smaller than average
df_filtered2 = df_filtered[df_filtered['floor_area_sqm'] < avg_floor_area]

# Calculating the average resale price
avg_resale_price = df_filtered2['resale_price'].mean()

# Printing the result
print(f"The average resale price for 3-room flats in Ang Mo Kio with floor area smaller than {avg_floor_area:.2f} sqm is ${avg_resale_price:.2f}.")

The average resale price for 3-room flats in Ang Mo Kio with floor area smaller than 70.96 sqm is $308690.80.

# Exporting Data
Save the processed file in Processed Data folder as <b>hdb_resale_full_processed.csv</b>

In [33]:
df_hdb.to_csv('data/1_processed_data/hdb_resale_full_processed.csv', index=False)

# Extra: Question X (Optional)

Get the data from the main table, with populations for each country from on this Wiki page:

[https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population](https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population)

You dataframe should look like this:

![](data/image.jpg)

In [ ]:
<..>
<..>

In [37]:
tables = pd.read_html('https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population')
tables[1]

    Rank                 Country / Dependency  Population                 \
    Rank                 Country / Dependency     Numbers % ofÂ the world
0      â€“                                World  8030120000           100%
1      1                                China  1411750000            NaN
2      2                                India  1392329000            NaN
3      3                        United States   334748000            NaN
4      4                            Indonesia   277749853            NaN
..   ...                                  ...         ...            ...
237    â€“                Tokelau (New Zealand)        1647            NaN
238    â€“                                 Niue        1549            NaN
239  195                         Vatican City         825            NaN
240    â€“  Cocos (Keeling) Islands (Australia)         593            NaN
241    â€“    Pitcairn Islands (United Kingdom)          47            NaN

            Date Source (official or from theÂ United Nations) Notes
            Date Source (official or from theÂ United Nations) Notes
0    13 May 2023                             UN projection[3]   NaN
1    31 Dec 2022                         Official estimate[4]   [b]
2     1 Mar 2023                       Official projection[5]   [c]
3    13 May 2023                 National population clock[7]   [d]
4    31 Dec 2022                         Official estimate[8]   NaN
..           ...                                          ...   ...
237   1 Jan 2019                            2019 Census [208]   NaN
238   1 Jul 2021               National annual projection[95]   NaN
239   1 Feb 2019               Monthly national estimate[209]  [af]
240  30 Jun 2020                             2021 Census[210]   NaN
241   1 Jul 2021                       Official estimate[211]   NaN

[242 rows x 7 columns]